jin04151/SmartHomeSafety_stm32-uC-OS3/app.c
        if (p_event == (APP_EVENT *)0) {
            continue;
        }

        OSMutexPend(&AppModeMutex,
                    0u,
                    OS_OPT_PEND_BLOCKING,
                    &ts,
                    &err);

        switch (p_event->Type) {
        case APP_EVENT_REQ_OUT:
            if (AppMode != APP_MODE_EMERGENCY) {
                AppPrevMode = AppMode;
                AppMode = APP_MODE_OUT;
                AppTrace("[INFO][STATE] Mode changed: OUT\r\n");
            }
            break;

        case APP_EVENT_REQ_HOME:
            if (AppMode != APP_MODE_EMERGENCY) {
                AppPrevMode = AppMode;
                AppMode = APP_MODE_HOME;
                AppTrace("[INFO][STATE] Mode changed: HOME\r\n");
            }
            break;

        case APP_EVENT_GAS:
            if (AppMode != APP_MODE_EMERGENCY) {
                AppPrevMode = AppMode;
                AppMode = APP_MODE_EMERGENCY;
                AppEmergencyActive = DEF_TRUE;
                AppEmergencyReason = APP_EMG_GAS;

                AppTrace("[ALERT][STATE] Mode changed: EMERGENCY - GAS\r\n");
                //AppBtSend("[ALERT] GAS detected at home!\r\n");
            }
            break;

        case APP_EVENT_FLAME:
            if (AppMode != APP_MODE_EMERGENCY) {
                AppPrevMode = AppMode;
                AppMode = APP_MODE_EMERGENCY;
                AppEmergencyActive = DEF_TRUE;
                AppEmergencyReason = APP_EMG_FLAME;

                AppTrace("[ALERT][STATE] Mode changed: EMERGENCY - FLAME\r\n");
                //AppBtSend("[ALERT] FIRE detected at home!\r\n");
            }
            break;

        case APP_EVENT_INTRUSION:
            if (AppMode != APP_MODE_EMERGENCY) {
                AppPrevMode = AppMode;
                AppMode = APP_MODE_EMERGENCY;
                AppEmergencyActive = DEF_TRUE;
                AppEmergencyReason = APP_EMG_INTRUSION;

                AppTrace("[ALERT][STATE] Mode changed: EMERGENCY - INTRUSION\r\n");
                //AppBtSend("[ALERT] Intrusion detected while you are out!\r\n");
            }
            break;

        case APP_EVENT_REQ_CLEAR:
            if (AppMode == APP_MODE_EMERGENCY) {
                if (AppDangerStillActive() == DEF_FALSE) {
                    AppMode = AppPrevMode;
                    AppEmergencyActive = DEF_FALSE;
                    AppEmergencyReason = APP_EMG_NONE;
                    AppTrace("[INFO][STATE] Emergency cleared\r\n");
                } else {
                    AppTrace("[WARN][STATE] Clear rejected: danger still active\r\n");
                }
            }
            break;

        case APP_EVENT_CMD_STATUS:
            AppPrintStatus();
            break;

        case APP_EVENT_CMD_HELP:
            AppPrintHelp();
            break;

        default:
            break;
        }

        OSMutexPost(&AppModeMutex,
                    OS_OPT_POST_NONE,
                    &err);

        AppApplyOutputs();
    }
}

/* ---------------- USART command task ---------------- */
static void AppTaskUsart(void *p_arg)
{
    OS_ERR   err;
    CPU_CHAR line[APP_CMD_LINE_LEN];

    (void)p_arg;

    while (DEF_TRUE) {
        if (AppUsartTryGetLine(line, sizeof(line)) == DEF_TRUE) {
            AppCommandCount++;
            AppCmdParse(line);
        }

        OSTimeDlyHMSM(0u,
                      0u,
                      0u,
                      20u,
                      OS_OPT_TIME_HMSM_STRICT,
                      &err);
    }
}

/* ---------------- Output heartbeat / emergency blink ---------------- */
static void AppTaskOutput(void *p_arg)
{
    OS_ERR      err;
    CPU_BOOLEAN servo_toggle = DEF_FALSE;
    CPU_INT08U  servo_tick = 0u;

    (void)p_arg;

    while (DEF_TRUE) {
        if (AppMode == APP_MODE_EMERGENCY) {

            /*
             * Emergency common:
             * - Buzzer ON
             * - Power cut LED RED ON
             */
            AppBuzzerOn();

            GPIO_SetBits  (POWER_LED_GPIO_PORT, POWER_LED_CUT_RED_PIN);
            GPIO_ResetBits(POWER_LED_GPIO_PORT, POWER_LED_NORMAL_GREEN_PIN);

            if (AppEmergencyReason == APP_EMG_FLAME) {
                /*
                 * FLAME:
                 * - Power cut ON
                 * - Gas state remains normal
                 * - Servo sprinkler motion
                 */
                GPIO_ResetBits(GAS_LED_GPIO_PORT, GAS_LED_CUT_RED_PIN);
                GPIO_SetBits  (GAS_LED_GPIO_PORT, GAS_LED_NORMAL_GREEN_PIN);

                servo_tick++;

                if (servo_tick >= 3u) {
                    servo_tick = 0u;

                    servo_toggle = (servo_toggle == DEF_TRUE)
                                   ? DEF_FALSE
                                   : DEF_TRUE;

                    if (servo_toggle == DEF_TRUE) {
                        AppServoSetAngle(30u);
                    } else {
                        AppServoSetAngle(150u);
                    }
                }

            } else if (AppEmergencyReason == APP_EMG_GAS) {
                /*
                 * GAS:
                 * - Power cut ON
                 * - Gas cut ON
                 * - Servo stopped
                 */
                GPIO_SetBits  (GAS_LED_GPIO_PORT, GAS_LED_CUT_RED_PIN);
                GPIO_ResetBits(GAS_LED_GPIO_PORT, GAS_LED_NORMAL_GREEN_PIN);

                servo_tick = 0u;
                servo_toggle = DEF_FALSE;
                AppServoSetAngle(0u);

            } else {
                /*
                 * INTRUSION or unknown emergency:
                 * - Buzzer only
                 * - Keep power cut LED ON because OUT mode is power-cut concept
                 * - Gas remains normal
                 */
                GPIO_ResetBits(GAS_LED_GPIO_PORT, GAS_LED_CUT_RED_PIN);
                GPIO_SetBits  (GAS_LED_GPIO_PORT, GAS_LED_NORMAL_GREEN_PIN);

                servo_tick = 0u;
                servo_toggle = DEF_FALSE;
                AppServoSetAngle(0u);
            }

        } else {
            servo_tick = 0u;
            servo_toggle = DEF_FALSE;
            AppApplyOutputs();
        }

        OSTimeDlyHMSM(0u,
                      0u,
                      0u,
                      200u,
                      OS_OPT_TIME_HMSM_STRICT,
                      &err);
    }
}

/* ---------------- Monitor task ---------------- */
static void AppTaskMonitor(void *p_arg)
{
    OS_ERR      err;
    BitAction   pir_raw;
    BitAction   last_pir_raw = Bit_RESET;
    CPU_BOOLEAN first = DEF_TRUE;

    (void)p_arg;

    while (DEF_TRUE) {
        pir_raw = GPIO_ReadInputDataBit(PIR_GPIO_PORT, PIR_GPIO_PIN);

