jin04151/SmartHomeSafety_stm32-uC-OS3/app.c
        /*
         * 100ms마다 확인.
         * 처음 1번 출력하고,
         * 이후에는 PIR raw 값이 바뀔 때만 출력.
         */
        if ((first == DEF_TRUE) ||
            (pir_raw != last_pir_raw)) {

            first = DEF_FALSE;
            last_pir_raw = pir_raw;

            if (pir_raw == Bit_SET) {
                AppTrace("[MONITOR] PIR raw = HIGH\r\n");
            } else {
                AppTrace("[MONITOR] PIR raw = LOW\r\n");
            }
        }

        OSTimeDlyHMSM(0u,
                      0u,
                      0u,
                      100u,
                      OS_OPT_TIME_HMSM_STRICT,
                      &err);
    }
}

/* ---------------- Kernel objects ---------------- */
static void AppObjCreate(void)
{
    OS_ERR err;

    OSFlagCreate(&AppEmergencyFlags,
                 "Emergency Flags",
                 0u,
                 &err);

    OSSemCreate(&AppPirSem,
                "PIR Semaphore",
                0u,
                &err);

    OSSemCreate(&AppButtonSem,
                "Button Semaphore",
                0u,
                &err);

    OSQCreate(&AppEventQ,
              "Event Queue",
              APP_EVENT_Q_SIZE,
              &err);

    OSMutexCreate(&AppModeMutex,
                  "Mode Mutex",
                  &err);

    AppMode = APP_MODE_HOME;
    AppPrevMode = APP_MODE_HOME;
    AppEmergencyReason = APP_EMG_NONE;
    AppEmergencyActive = DEF_FALSE;
    AppPirDetected = DEF_FALSE;

    AppEventWrIx = 0u;

    AppGasCount = 0u;
    AppFlameCount = 0u;
    AppPirCount = 0u;
    AppButtonCount = 0u;
    AppCommandCount = 0u;
}

/* ---------------- Task create ---------------- */
static void AppTaskCreate(void)
{
    OS_ERR err;

    OSTaskCreate(&AppTaskEmergencyTCB,
                 "Emergency Task",
                 AppTaskEmergency,
                 0,
                 APP_CFG_EMERGENCY_TASK_PRIO,
                 &AppTaskEmergencyStk[0],
                 APP_CFG_TASK_STK_SIZE / 10,
                 APP_CFG_TASK_STK_SIZE,
                 0,
                 0,
                 0,
                 OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                 &err);

    OSTaskCreate(&AppTaskSecurityTCB,
                 "Security Task",
                 AppTaskSecurity,
                 0,
                 APP_CFG_SECURITY_TASK_PRIO,
                 &AppTaskSecurityStk[0],
                 APP_CFG_TASK_STK_SIZE / 10,
                 APP_CFG_TASK_STK_SIZE,
                 0,
                 0,
                 0,
                 OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                 &err);

    OSTaskCreate(&AppTaskInputTCB,
                 "Input Task",
                 AppTaskInput,
                 0,
                 APP_CFG_INPUT_TASK_PRIO,
                 &AppTaskInputStk[0],
                 APP_CFG_TASK_STK_SIZE / 10,
                 APP_CFG_TASK_STK_SIZE,
                 0,
                 0,
                 0,
                 OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                 &err);

    OSTaskCreate(&AppTaskStateTCB,
                 "State Task",
                 AppTaskState,
                 0,
                 APP_CFG_STATE_TASK_PRIO,
                 &AppTaskStateStk[0],
                 APP_CFG_TASK_STK_SIZE / 10,
                 APP_CFG_TASK_STK_SIZE,
                 0,
                 0,
                 0,
                 OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                 &err);

    OSTaskCreate(&AppTaskUsartTCB,
                 "USART Task",
                 AppTaskUsart,
                 0,
                 APP_CFG_USART_TASK_PRIO,
                 &AppTaskUsartStk[0],
                 APP_CFG_TASK_STK_SIZE / 10,
                 APP_CFG_TASK_STK_SIZE,
                 0,
                 0,
                 0,
                 OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                 &err);

    OSTaskCreate(&AppTaskOutputTCB,
                 "Output Task",
                 AppTaskOutput,
                 0,
                 APP_CFG_OUTPUT_TASK_PRIO,
                 &AppTaskOutputStk[0],
                 APP_CFG_TASK_STK_SIZE / 10,
                 APP_CFG_TASK_STK_SIZE,
                 0,
                 0,
                 0,
                 OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                 &err);

    OSTaskCreate(&AppTaskMonitorTCB,
                 "Monitor Task",
                 AppTaskMonitor,
                 0,
                 APP_CFG_MONITOR_TASK_PRIO,
                 &AppTaskMonitorStk[0],
                 APP_CFG_TASK_STK_SIZE / 10,
                 APP_CFG_TASK_STK_SIZE,
                 0,
                 0,
                 0,
                 OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR,
                 &err);
}

/* ---------------- GPIO / EXTI ---------------- */
static void AppGpioInit(void)
{
    GPIO_InitTypeDef gpio;

    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA |
                       RCC_AHB1Periph_GPIOB |
                       RCC_AHB1Periph_GPIOC |
                       RCC_AHB1Periph_GPIOD |
                       RCC_AHB1Periph_GPIOE |
                       RCC_AHB1Periph_GPIOF,
                       ENABLE);

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG,
                           ENABLE);

    /*
     * LED output
     */
    gpio.GPIO_Mode  = GPIO_Mode_OUT;
    gpio.GPIO_OType = GPIO_OType_PP;
    gpio.GPIO_Speed = GPIO_Speed_2MHz;
    gpio.GPIO_PuPd  = GPIO_PuPd_NOPULL;

    /* Power LED: PB8, PB9 */
    gpio.GPIO_Pin = POWER_LED_CUT_RED_PIN |
                    POWER_LED_NORMAL_GREEN_PIN;
    GPIO_Init(POWER_LED_GPIO_PORT, &gpio);

    /* Gas LED: PA6, PA7 */
    gpio.GPIO_Pin = GAS_LED_CUT_RED_PIN |
                    GAS_LED_NORMAL_GREEN_PIN;
    GPIO_Init(GAS_LED_GPIO_PORT, &gpio);

    /*
    * Buzzer output
    * LOW trigger module이면 출력 모드로 바뀌는 순간 울릴 수 있으므로
    * 먼저 OFF 상태를 ODR에 써두고 GPIO output으로 설정.
    */
    AppBuzzerOff();

    gpio.GPIO_Pin = BUZZER_GPIO_PIN;
    GPIO_Init(BUZZER_GPIO_PORT, &gpio);

    AppBuzzerOff();

