jin04151/SmartHomeSafety_stm32-uC-OS3/app.c
static void AppServoSetAngle(CPU_INT08U degree)
{
	CPU_INT16U pulse_us;

	    pulse_us = 1000u + ((CPU_INT16U)degree * 1000u / 180u);

	    TIM_SetCompare1(TIM1, pulse_us);
}

static CPU_BOOLEAN AppDangerStillActive(void)
{
    CPU_BOOLEAN gas_on;
    CPU_BOOLEAN flame_on;

    gas_on = (GPIO_ReadInputDataBit(GAS_GPIO_PORT, GAS_GPIO_PIN) == Bit_SET)
             ? DEF_TRUE
             : DEF_FALSE;

    flame_on = (GPIO_ReadInputDataBit(FLAME_GPIO_PORT, FLAME_GPIO_PIN) == Bit_SET)
               ? DEF_TRUE
               : DEF_FALSE;

    if ((gas_on == DEF_TRUE) || (flame_on == DEF_TRUE)) {
        return DEF_TRUE;
    }

    return DEF_FALSE;
}

/* ---------------- USART / string helpers ---------------- */
static void AppTrace(const CPU_CHAR *msg)
{
    while (*msg != '\0') {
        /* Send log to PC via USART3 */
        while (USART_GetFlagStatus(USART3, USART_FLAG_TXE) == RESET) {
        }
        USART_SendData(USART3, (uint16_t)(*msg));

        /* Send log to Bluetooth via USART6 simultaneously */
        while (USART_GetFlagStatus(USART6, USART_FLAG_TXE) == RESET) {
        }
        USART_SendData(USART6, (uint16_t)(*msg));

        msg++;
    }
}

static CPU_BOOLEAN AppUsartTryGetLine(CPU_CHAR *buf, CPU_INT16U buf_len)
{
    static CPU_CHAR  rx_buf[APP_CMD_LINE_LEN];
    static CPU_INT16U ix = 0u;

    CPU_CHAR ch = (CPU_CHAR)0;
    CPU_BOOLEAN data_received = DEF_FALSE;

    /* Check input from PC (USART3) */
    if (USART_GetFlagStatus(USART3, USART_FLAG_RXNE) != RESET) {
        ch = (CPU_CHAR)USART_ReceiveData(USART3);
        data_received = DEF_TRUE;
    }
    /* Check input from Bluetooth (USART6) */
    else if (USART_GetFlagStatus(USART6, USART_FLAG_RXNE) != RESET) {
        ch = (CPU_CHAR)USART_ReceiveData(USART6);
        data_received = DEF_TRUE;
    }

    /* Return if no data is received from either channel */
    if (data_received == DEF_FALSE) {
        return DEF_FALSE;
    }

    APP_TRACE_DBG(("%c", ch));

    if ((ch == '\r') || (ch == '\n')) {
        rx_buf[ix] = (CPU_CHAR)0;
        ix = 0u;

        if (rx_buf[0] == (CPU_CHAR)0) {
            return DEF_FALSE;
        }

        for (ix = 0u;
             (ix < buf_len - 1u) && (rx_buf[ix] != (CPU_CHAR)0);
             ix++) {
            buf[ix] = rx_buf[ix];
        }

        buf[ix] = (CPU_CHAR)0;
        ix = 0u;

        AppTrace("\r\n");

        return DEF_TRUE;
    }

    if (ix < (APP_CMD_LINE_LEN - 1u)) {
        rx_buf[ix++] = ch;
    } else {
        ix = 0u;
        AppTrace("\r\n[WARN][USART] command buffer overflow\r\n");
    }

    return DEF_FALSE;
}

static CPU_BOOLEAN AppStrEq(const CPU_CHAR *a, const CPU_CHAR *b)
{
    while ((*a != (CPU_CHAR)0) && (*b != (CPU_CHAR)0)) {
        if (*a != *b) {
            return DEF_FALSE;
        }

        a++;
        b++;
    }

    if ((*a == (CPU_CHAR)0) && (*b == (CPU_CHAR)0)) {
        return DEF_TRUE;
    }

    return DEF_FALSE;
}
/* ---------------- USART3 SETUP ---------------- */
static void Setup_Usart3(void)
{
    GPIO_InitTypeDef gpio_init = {0};
    USART_InitTypeDef usart_init = {0};

    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);

    GPIO_PinAFConfig(GPIOD, GPIO_PinSource8, GPIO_AF_USART3);
    GPIO_PinAFConfig(GPIOD, GPIO_PinSource9, GPIO_AF_USART3);

    gpio_init.GPIO_Pin   = GPIO_Pin_8 | GPIO_Pin_9;
    gpio_init.GPIO_Mode  = GPIO_Mode_AF;
    gpio_init.GPIO_OType = GPIO_OType_PP;
    gpio_init.GPIO_PuPd  = GPIO_PuPd_UP;
    gpio_init.GPIO_Speed = GPIO_Speed_50MHz;

    GPIO_Init(GPIOD, &gpio_init);

    usart_init.USART_BaudRate = 115200;
    usart_init.USART_WordLength = USART_WordLength_8b;
    usart_init.USART_StopBits = USART_StopBits_1;
    usart_init.USART_Parity = USART_Parity_No;
    usart_init.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    usart_init.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

    USART_Init(USART3, &usart_init);
    USART_Cmd(USART3, ENABLE);
}

static void Setup_Servo_PWM(void)
{
    GPIO_InitTypeDef         gpio_init = {0};
    TIM_TimeBaseInitTypeDef  tim_init  = {0};
    TIM_OCInitTypeDef        oc_init   = {0};

    /* GPIOE clock + TIM1 clock */
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1, ENABLE);

    gpio_init.GPIO_Pin   = GPIO_Pin_9;
    gpio_init.GPIO_Mode  = GPIO_Mode_AF;
    gpio_init.GPIO_OType = GPIO_OType_PP;
    gpio_init.GPIO_PuPd  = GPIO_PuPd_NOPULL;
    gpio_init.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOE, &gpio_init);

    GPIO_PinAFConfig(GPIOE, GPIO_PinSource9, GPIO_AF_TIM1);

    /* TIM1: 180MHz / (180-1+1) / (20000-1+1) = 50Hz (20ms) */
    tim_init.TIM_Prescaler     = 180 - 1;       /* 1MHz tick */
    tim_init.TIM_Period        = 20000 - 1;     /* 20ms period */
    tim_init.TIM_CounterMode   = TIM_CounterMode_Up;
    tim_init.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseInit(TIM1, &tim_init);

    /* TIM1 CH1 PWM mode */
    oc_init.TIM_OCMode      = TIM_OCMode_PWM1;
    oc_init.TIM_OutputState = TIM_OutputState_Enable;
    oc_init.TIM_Pulse       = 1000;
    oc_init.TIM_OCPolarity  = TIM_OCPolarity_High;
    TIM_OC1Init(TIM1, &oc_init);

    TIM_OC1PreloadConfig(TIM1, TIM_OCPreload_Enable);
    TIM_ARRPreloadConfig(TIM1, ENABLE);

    TIM_CtrlPWMOutputs(TIM1, ENABLE);
    TIM_Cmd(TIM1, ENABLE);
}
/* ---------------- USART6 (HC-06 Bluetooth) SETUP ----------------
 * HC-06 TXD -> D0 / PG9  / USART6_RX
 * HC-06 RXD -> D1 / PG14 / USART6_TX
 */
static void Setup_Usart6_BT(void)
{
    GPIO_InitTypeDef  gpio_init  = {0};
    USART_InitTypeDef usart_init = {0};

    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOG, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART6, ENABLE);

    /*
     * D0  = PG9  = USART6_RX
     * D1  = PG14 = USART6_TX
     */
    GPIO_PinAFConfig(GPIOG, GPIO_PinSource9,  GPIO_AF_USART6);
    GPIO_PinAFConfig(GPIOG, GPIO_PinSource14, GPIO_AF_USART6);

    gpio_init.GPIO_Pin   = GPIO_Pin_9 | GPIO_Pin_14;
    gpio_init.GPIO_Mode  = GPIO_Mode_AF;
    gpio_init.GPIO_OType = GPIO_OType_PP;
    gpio_init.GPIO_PuPd  = GPIO_PuPd_UP;
    gpio_init.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOG, &gpio_init);

    /*
     * HC-06 기본 baud는 보통 9600
     */
    usart_init.USART_BaudRate            = 9600;
    usart_init.USART_WordLength          = USART_WordLength_8b;
    usart_init.USART_StopBits            = USART_StopBits_1;
    usart_init.USART_Parity              = USART_Parity_No;
    usart_init.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    usart_init.USART_Mode                = USART_Mode_Rx | USART_Mode_Tx;

    USART_Init(USART6, &usart_init);
    USART_Cmd(USART6, ENABLE);
}